# 함수 1

# ===========================================================
# 1. 기본 함수
# ===========================================================
def add(a, b):
    """a + b한 결과를 반환한다. 함수 안에서 쓰는 주석"""
    return a + b    # .__add__() 호출

int.__add__ #사실 내부적으로 a, b에 int를 넣으면 이 메소드를 호출함. int 클래스의 .__add__() 메소드
str.__add__
list.__add__

print(add(1, 2))
print(add('hello', 'python'))
print(add([1, 2, 3], [5, 6, 7]))
print(add((1, 2), (1, 2, 3)))
print(add.__doc__) # 함수 안의 독스트링 반환




# ===========================================================
# 2. 튜플을 리턴하는 함수
# ===========================================================
def add_sub(a, b):
    return a + b, a - b
print(add_sub(5, 3))



# ===========================================================
# 3. 디폴트 매개변수 (Default Parameter)
# ===========================================================
# 매개변수에 기본값을 지정하면, 호출 시 해당 인자를 생략할 수 있다.
# 디폴트 매개변수는 항상 일반 매개변수 뒤에 위치해야 한다.
def add(a, b = 0):
     return a + b
print(add(5, 10))
print(add(5))



# ===========================================================
# 4. 키워드 인자 (Keyword Argument)
# ===========================================================
# 인자를 순서가 아니라 "매개변수명=값" 형태로 전달할 수 있다.
# 순서를 바꿔서 호출해도 이름만 맞으면 정확히 전달된다.

print(add(5, 10))   # 순서대로 인자 전달
print(add(b = 0, a = 0))    # 키워드 인자로 매칭

def introduce(name, age, city = '안산'):
    return f"저는 {name}이고, {age}살이고, {city}에 살아요"

print(introduce('박하늘', 17, '군포'))
print(introduce(age=17, city='군포', name='박하늘'))    # 순서 상관이 없음
print(introduce(age=17, name='박하늘'))    # 디폴트가 안산이라 생략하면 디폴트 매개변수인 안산이 나옴





# ===========================================================
# 5. 가변 인자 (Variable-length Argument, *args)
# ===========================================================
# 몇 개의 인자가 들어올지 모를 때 *args를 사용한다. (관례적으로 사용)
# args라는 이름으로 입력값들을 모아 튜플로 만든다.

def add_all(*args): # 가변 인자는 튜플
    print(args)
    return sum(args)

print(add_all(1, 2, 3))
print(add_all(1, 2, 3, 4, 5))

a = [1, 2, 3]
print(add_all(*a))


# ================================================================
# 6. 키워드 가변 인자 (Keyword Variable-length Argument, **kwargs)
# ================================================================
# 이름=값 형태로 몇 개가 들어올지 모를 때 **kwargs를 사용한다.
# kwargs라는 이름으로 입력값들을 모아 딕셔너리로 만든다.
def introduce2(**kargs):
    print(kargs)

s
d = {"name": "크롱", "age": 4, "kind": "공룡"}

introduce2(name = "크롱", age = 4, kind = "공룡")
introduce2(**d) # 안에 있는 내용물 뽑기

# ===========================================================
# 7. *args와 **kwargs를 함께 사용하는 예시
# ===========================================================

# 디미가 현재 가진 돈 구하기
# - 지난 달 남은 돈 : 500원
# - 길 가다가 주운 돈 : 100원, 200원 => 가변인자 (튜플)
# - 아빠한테 받은 돈 : 10000원
# - 엄마한테 받은 돈 : 5000원 => 키워드 가변인자 (딕셔너리)

def pocket_money(last_month, *args, **kwargs):
    return last_month + sum(args) + sum(kwargs.values())

print(pocket_money(500, 100, 200, dad=10000, mom=5000))
    