# 집합 기초

# ===========================================================
#  집합 (set): 여러 객체를 순서 없이 중복을 허용하지 않고 저장하는 변경 가능한 자료형
#  집합의 특징
#  1. ( mutable : 원본변경가능하다 )
#  2. ( iterable : 반복가능하다 )
#  3. ( sequence X : 인덱싱과 슬라이싱이 불가하다 )
#  4. ( 중복 허용 안함 )
# ===========================================================

# 집합 생성
a = set() # a = {} 이렇게 하면 딕셔너리로 인식됨
print(type(a))

a = {3, 3, 3, 2, 2, 1}
print(a) # 중복을 알아서 없애버림

b = {2014, 20, 34, 234, 13}
print(b) #순서가 의미가 없다

# ===========================================================
# 1. 집합은 mutable하다. (원본 변경 가능)
# ===========================================================

a.update({3, 4})
print(a)

a.pop() # 이러면 랜덤으로 하나 삭제함
print(a)

a.remove(3) # 이러면 3을 삭제 

# ===========================================================
# 2. 집합은 iterable하다. (반복 가능)
# ===========================================================

# 집합 순회
# a[0] = 100 # __setitem__이 없으면 나는 에러



# ===========================================================
# 3. 집합은 sequence 객체가 아니다. (인덱싱, 슬라이싱 불가)
# ===========================================================



# ===========================================================
# 4. 집합은 중복을 허용하지 않는다.
# ===========================================================

s = {10,20, 20, 30}
print(s)

# ===========================================================
#  파이썬 내장 함수
# ===========================================================

print(len(s))
print(sum(s))
print(min(s))
print(max(s))
print(sorted(s))


# 집합 합치기
s2 = {40, 50}

# print(s + s2) 당연히안됨
print(s.union(s2)) # 합집합 개념. update와 결과는동일,union은 새로운 집합을 생성함

# 집합 반복하기
# print(s * 2) 당연히안됨 중복되니까

# 멤버십 연산자
print(10 in s)
print(1 in s)
